Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_UsingSwiftWithCocoaAndObjective-C/Swift_BCA-level2.tmx
Source language: en_us
Languages: ja

source: You can use two different attributes—@IBDesignable and @IBInspectable—to enable live, interactive custom view design in Interface Builder.
ja: あなたは、インタフェースビルダーにおいて、生の、双方向のあつらえのビュー設計をできるように、２つの異なる属性 ― @IBDesignableと@IBInspectable ― を使うことができます。

source: You cannot import C++ code directly into Swift.
ja: あなたは、スウィフトに直接C++コードをインポートすることができません。

source: You cannot override the product module name of a framework.
ja: あなたは、フレームワークの製品モジュール名をオーバーライドすることができません。

source: You cannot reorder or change the number of arguments for type members imported using the CF_SWIFT_NAME macro.
ja: あなたは、CF_SWIFT_NAMEマクロを使ってインポートされる型メンバのための引数の数を変更したり順番を変えたりできません。

source: You cannot subclass a Swift class in Objective-C.
ja: あなたは、スウィフトクラスのサブクラスをObjective-Cにおいて作成できません。

source: You cannot use extensions to override existing methods or properties on Objective-C types.
ja: あなたは、Objective-C型上での既存のメソッドまたはプロパティをオーバーライドするために拡張を使うことができません。

source: You choose which method to use based on whether the API you are invoking returns an unretained or retained object.
ja: あなたは、あなたが呼んでいるAPIが保有されない、または保有されるオブジェクトを返すかに基づいて、どちらかのメソッドを選びます。

source: You create a new option set from a constant value or expression, An empty option set is represented by the constant zero (0).
ja: あなたは、新しいオプションセットを定数値または式から作成します。空のオプションセットは定数ゼロ（0）で表現されます。

source: You don’t need to do anything special to create the generated header file—just import it to use its contents in your Objective-C code.
ja: あなたは、生成ヘッダ・ファイルを作成するために特に何もする必要がありません ― あなたは、単にあなたのObjective-Cコードにおいてその内容を使うためにそれをインポートしてください。

source: You might encounter Objective-C code that uses the older NS_STRING_ENUM and NS_EXTENSIBLE_STRING_ENUM macros, which were used to group string constants.
ja: あなたは、より古いNS_STRING_ENUMおよびNS_EXTENSIBLE_STRING_ENUMマクロを使うObjective-Cコードに直面するかもしれません、それは文字列定数をグループにするために使われました。

source: You must cast it back to another type to perform other operations.
ja: あなたは、他の操作を実行するために再び別の型へそれをキャストしなければなりません。

source: You should not override the equality or identity operators for types imported from Objective-C.
ja: あなたは、Objective-Cからインポートされた型に対する同等性または同一性演算子をオーバーライドすべきではありません。

source: You should use NS_TYPED_ENUM and NS_TYPED_EXTENSIBLE_ENUM when grouping related constants of any type, including string constants.
ja: あなたは、NS_TYPED_ENUMおよびNS_TYPED_EXTENSIBLE_ENUMを、文字列定数を含む何らかの型の関連する定数をグループにする時に使うべきです。

source: You use complex macros in C and Objective-C to avoid type-checking constraints or to avoid retyping large amounts of boilerplate code.
ja: あなたは、複雑なマクロをCとObjective-Cにおいて型チェック制約を避けたり、常用文コードの大きな塊を繰り返しタイピングすることを避けるために使います。

source: You use native Swift initialization syntax even when you are working with Objective-C classes—Swift converts Objective-C initialization methods to Swift initializers.
ja: あなたがObjective-Cクラスを扱っているときでも、あなたは生粋のスウィフト初期化構文を使います ― スウィフトは、Objective-C初期化メソッドをスウィフトイニシャライザに変換します。

source: You use the @objc attribute along with the dynamic modifier to require that access to members be dynamically dispatched through the Objective-C runtime.
ja: あなたは、@objc属性に加えてdynamic修飾子を使うことで、メンバへのアクセスがObjective-Cランタイムを通して動的にディスパッチされることを要請します。

source: You use the @NSManaged attribute to inform the Swift compiler that Core Data provides the storage and implementation of a declaration at runtime.
ja: あなたは、@NSManaged属性を使って、コアデータがある宣言のストレージと実装を実行時に提供することをスウィフトコンパイラに知らせます。

source: You use the insert(_:) or formUnion(_:) methods to add option values, the remove(_:) or subtract(_:) methods to remove option values, and the contains(_:) method to check for an option value.
ja: あなたはinsert(_:)またはformUnion(_:)メソッドを使ってオプション値を付け加え、remove(_:)またはsubtract(_:)メソッドを使ってオプション値を削除し、そしてcontains(_:)メソッドを使ってあるオプション値を調べます。

source: You use the bitwise OR operator (|) to combine option values, and the bitwise AND operator (&) to check for option values.
ja: あなたはビット単位OR演算子（|）をオプション値を結合するために、そしてビット単位AND演算子（&）をオプション値の確認に使います。

source: You use the same @IBOutlet attribute to declare an outlet collection—just specify an array for the type.
ja: あなたは、同じ@IBOutlet属性をアウトレット・コレクションを宣言するために使います ― ちょうどある配列に型を指定するように。

source: You use this when calling C functions from Swift that take the size of a type or value as an argument.
ja: あなたがこれを使うのは、ある型や値のサイズを引数としてとるC関数をスウィフトから呼び出している時です。

source: You won’t create a header file; Xcode generates a header automatically in case you need to reference it.
ja: あなたはヘッダ・ファイルを作成しません；あなたがそれに参照をつける必要がある場合に備えて、Xcodeが自動的にヘッダを生成します。

source: Your existing code should follow modern coding practices to make it easier to interact with Swift seamlessly.
ja: あなたの既存のコードは、継ぎ目なくスウィフトと相互に作用することをより簡単にするために、現代のコード記述慣行に従わなければなりません。

source: You’ll need to edit the bridging header file to expose your Objective-C code to your Swift code.
ja: あなたは、あなたのObjective-Cコードをあなたのスウィフトコードに露出するためにこのファイルを編集する必要があります。

source: You’ll replace the .m and .h files for that class with a single .swift file.
ja: あなたは、そのクラスのための.mと.hファイルを単一の.swiftファイルで置き換えます。

source: id Compatibility
ja: id互換性
